RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Inc/stm32g4xx_hal_rcc_ex.h
#define IS_RCC_I2C3CLKSOURCE(__SOURCE__)   \
               (((__SOURCE__) == RCC_I2C3CLKSOURCE_PCLK1) || \
                ((__SOURCE__) == RCC_I2C3CLKSOURCE_SYSCLK)|| \
                ((__SOURCE__) == RCC_I2C3CLKSOURCE_HSI))

#if defined(I2C4)

#define IS_RCC_I2C4CLKSOURCE(__SOURCE__)   \
               (((__SOURCE__) == RCC_I2C4CLKSOURCE_PCLK1) || \
                ((__SOURCE__) == RCC_I2C4CLKSOURCE_SYSCLK)|| \
                ((__SOURCE__) == RCC_I2C4CLKSOURCE_HSI))

#endif /* I2C4 */

#define IS_RCC_LPTIM1CLKSOURCE(__SOURCE__)  \
               (((__SOURCE__) == RCC_LPTIM1CLKSOURCE_PCLK1) || \
                ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSI)   || \
                ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_HSI)   || \
                ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSE))

#define IS_RCC_SAI1CLKSOURCE(__SOURCE__)   \
               (((__SOURCE__) == RCC_SAI1CLKSOURCE_SYSCLK)  || \
                ((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL)     || \
                ((__SOURCE__) == RCC_SAI1CLKSOURCE_EXT)     || \
                ((__SOURCE__) == RCC_SAI1CLKSOURCE_HSI))

#define IS_RCC_I2SCLKSOURCE(__SOURCE__)   \
               (((__SOURCE__) == RCC_I2SCLKSOURCE_SYSCLK)  || \
                ((__SOURCE__) == RCC_I2SCLKSOURCE_PLL)     || \
                ((__SOURCE__) == RCC_I2SCLKSOURCE_EXT)     || \
                ((__SOURCE__) == RCC_I2SCLKSOURCE_HSI))

#if defined(FDCAN1)
#define IS_RCC_FDCANCLKSOURCE(__SOURCE__)   \
               (((__SOURCE__) == RCC_FDCANCLKSOURCE_HSE) || \
                ((__SOURCE__) == RCC_FDCANCLKSOURCE_PLL) || \
                ((__SOURCE__) == RCC_FDCANCLKSOURCE_PCLK1))

#endif /* FDCAN1 */
#define IS_RCC_RNGCLKSOURCE(__SOURCE__)  \
               (((__SOURCE__) == RCC_RNGCLKSOURCE_HSI48)   || \
                ((__SOURCE__) == RCC_RNGCLKSOURCE_PLL))

#if defined(USB)
#define IS_RCC_USBCLKSOURCE(__SOURCE__)  \
               (((__SOURCE__) == RCC_USBCLKSOURCE_HSI48)   || \
                ((__SOURCE__) == RCC_USBCLKSOURCE_PLL))

#endif /* USB */

#define IS_RCC_ADC12CLKSOURCE(__SOURCE__)  \
               (((__SOURCE__) == RCC_ADC12CLKSOURCE_NONE)    || \
                ((__SOURCE__) == RCC_ADC12CLKSOURCE_PLL)     || \
                ((__SOURCE__) == RCC_ADC12CLKSOURCE_SYSCLK))

#if defined(ADC345_COMMON)
#define IS_RCC_ADC345CLKSOURCE(__SOURCE__)  \
               (((__SOURCE__) == RCC_ADC345CLKSOURCE_NONE)    || \
                ((__SOURCE__) == RCC_ADC345CLKSOURCE_PLL)     || \
                ((__SOURCE__) == RCC_ADC345CLKSOURCE_SYSCLK))
#endif /* ADC345_COMMON */

#if defined(QUADSPI)

#define IS_RCC_QSPICLKSOURCE(__SOURCE__)  \
                (((__SOURCE__) == RCC_QSPICLKSOURCE_HSI)   || \
                 ((__SOURCE__) == RCC_QSPICLKSOURCE_SYSCLK)|| \
                 ((__SOURCE__) == RCC_QSPICLKSOURCE_PLL))

#endif /* QUADSPI */

#define IS_RCC_CRS_SYNC_SOURCE(__SOURCE__) (((__SOURCE__) == RCC_CRS_SYNC_SOURCE_GPIO) || \
                                            ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_LSE)  || \
                                            ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_USB))

#define IS_RCC_CRS_SYNC_DIV(__DIV__)       (((__DIV__) == RCC_CRS_SYNC_DIV1)  || ((__DIV__) == RCC_CRS_SYNC_DIV2)  || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV4)  || ((__DIV__) == RCC_CRS_SYNC_DIV8)  || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV16) || ((__DIV__) == RCC_CRS_SYNC_DIV32) || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV64) || ((__DIV__) == RCC_CRS_SYNC_DIV128))

#define IS_RCC_CRS_SYNC_POLARITY(__POLARITY__) (((__POLARITY__) == RCC_CRS_SYNC_POLARITY_RISING) || \
                                                ((__POLARITY__) == RCC_CRS_SYNC_POLARITY_FALLING))

#define IS_RCC_CRS_RELOADVALUE(__VALUE__)  (((__VALUE__) <= 0xFFFFU))

#define IS_RCC_CRS_ERRORLIMIT(__VALUE__)   (((__VALUE__) <= 0xFFU))

#define IS_RCC_CRS_HSI48CALIBRATION(__VALUE__) (((__VALUE__) <= 0x3FU))

#define IS_RCC_CRS_FREQERRORDIR(__DIR__)   (((__DIR__) == RCC_CRS_FREQERRORDIR_UP) || \
                                            ((__DIR__) == RCC_CRS_FREQERRORDIR_DOWN))

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32G4xx_HAL_RCC_EX_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
